CODES_OF_ERRORS = {
    10: "Couldn't decode the text into json - Не удалось расшифровать текст в json.",
    20: "A Connection error occurred - Произошла ошибка подключения.",
    25: "The request timed out while trying to connect to the remote server. "
    "Requests that produced this error are safe to retry. - Время ожидания запроса истекло "
    "при попытке подключения к удаленному серверу. Запросы, вызвавшие эту ошибку, можно безопасно повторить",
    30: "Error unknown - Неизвестная ошибка",
    100: "Error key - Ошибка авторизации, неверный ключ ",
    105: "Error ip - Доступ к API произошел с неверного IP (если включено "
    "ограничение), либо некорректный формат IP адреса",
    110: "Error method - Ошибочный метод ",
    200: "Error count - Ошибка кол-ва прокси, неверно указано кол-во, " "либо отсутствует",
    210: "Error period - Ошибка периода, неверно указано кол-во (дней), " "либо отсутствует",
    220: "Error country - Ошибка страны, неверно указана страна "
    "(страны указываются в формате iso2), либо отсутствует",
    230: "Error ids - Ошибка списка номеров прокси. Номера прокси " "должны быть указаны через запятую",
    240: "Error version - Некорректно указана версия прокси",
    250: "Error descr - Ошибка технического комментария, неверно указан, " "либо отсутствует",
    260: "Error type - Ошибка типа (протокола) прокси, неверно указан, " "либо отсутствует",
    300: "Error active proxy allow - Ошибка кол-ва прокси. Возникает при "
    "попытке покупки большего кол-ва прокси, чем доступно на сервисе",
    400: "Error no money - Ошибка баланса. На вашем балансе отсутствуют "
    "средства, либо их не хватает для покупки запрашиваемого кол-ва прокси",
    404: "Error not found - Ошибка поиска. " "Возникает когда запрашиваемый элемент не найден",
    410: "Error price - Ошибка расчета стоимости. " "Итоговая стоимость меньше, либо равна нулю",
}
